---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.ToposolidOverlap
source: html/da80c265-cd05-c353-f53b-02c63870fd5d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.ToposolidOverlap Property

Highlighted toposolid overlap.

## Syntax (C#)
```csharp
public static FailureDefinitionId ToposolidOverlap { get; }
```